arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <dim>2</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>ADCMPANSR[%s]</name>
          <description>A/D Compare Function Window A Channel Select Register</description>
          <addressOffset>0x094</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>1</dimIncrement>
              <name>CMPCHA%s</name>
              <description>AN Input Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Excludes Input from the compare window A target range.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Includes Input  from the compare window A target range.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>ADCMPLR[%s]</name>
          <description>A/D Compare Function Window A Comparison Condition Setting Register</description>
          <addressOffset>0x098</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>1</dimIncrement>
              <name>CMPLCHA%s</name>
              <description>Comparison condition of input</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPDR0</name>
          <description>A/D Compare Function Window A Lower-Side Level Setting Register</description>
          <addressOffset>0x09C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADCMPDR0</name>
              <description>The ADCMPDR0 register sets the reference data when the compare window A function is used. ADCMPDR0 sets the lower-side level of window A.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPDR1</name>
          <description>A/D Compare Function Window A Upper-Side Level Setting Register</description>
          <addressOffset>0x09E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADCMPDR1</name>
              <description>The ADCMPDR1 register sets the reference data when the compare window A function is used. ADCMPDR1 sets the upper-side level of window A..</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>ADCMPSR[%s]</name>
          <description>A/D Compare Function Window A Channel Status Register</description>
          <addressOffset>0x0A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>1</dimIncrement>
              <name>CMPSTCHA%s</name>
              <description>Compare window A flag of input</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison conditions are not met.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison conditions are met.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPSER</name>
          <description>A/D Compare Function Window A Extended Input Channel Status Register</description>
          <addressOffset>0x0A4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CMPSTOCA</name>
              <description>Compare Window A Internal Reference Voltage Compare Flag When window A operation is enabled (ADCMPCR.CMPAE = 1b), this bit indicates the temperature sensor output comparison result. When window A operation is disabled (ADCMPCR.CMPAE = 0b), comparison conditions for CMPSTTSA are not met any time.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison conditions are not met.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison conditions are met.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPSTTSA</name>
              <description>Compare Window A Temperature Sensor Output Compare Flag When window A operation is enabled (ADCMPCR.CMPAE = 1b), this bit indicates the temperature sensor output comparison result. When window A operation is disabled (ADCMPCR.CMPAE = 0b), comparison conditions for CMPSTTSA are not met any time.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison conditions are not met.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison conditions are met.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPBNSR</name>
          <description>A/D Compare Function Window B Channel Selection Register</description>
          <addressOffset>0x0A6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CMPLB</name>
              <description>Compare window B Compare condition setting bit.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>CMPLLB value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; CMPLLB value or CMPULB value &lt; A/D converted value  (ADCMPCR.WCMPE=1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>CMPLLB value &lt; A/D converted value(ADCMPCR.WCMPE=0) / CMPLLB value &lt; A/D converted value &lt; CMPULB value (ADCMPCR.WCMPE=1)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPCHB</name>
              <description>Compare window B channel selection bit.The channel that compares it on the condition of compare window B is selected.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>AN000</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x01</name>
                  <description>AN001</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>AN002</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x03</name>
                  <description>AN003</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>AN004</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>AN005</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>AN006</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>AN007</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>AN008</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>AN009</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>AN010</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>AN011</description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>AN012</description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>AN013</description>
                  <value>0x0D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0E</name>
                  <description>AN014</description>
                  <value>0x0E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0F</name>
                  <description>AN015</description>
                  <value>0x0F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>AN016</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x11</name>
                  <description>AN017</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x12</name>
                  <description>AN018</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x13</name>
                  <description>AN019</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x14</name>
                  <description>AN020</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x15</name>
                  <description>AN021</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x16</name>
                  <description>AN022</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x17</name>
                  <description>AN023</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x18</name>
                  <description>AN024</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x19</name>
                  <description>AN025</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1A</name>
                  <description>AN026</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1B</name>
                  <description>AN027</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x20</name>
                  <description>Temperature sensor</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x21</name>
                  <description>Internal reference voltage</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x3F</name>
                  <description>No channel is selected</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADWINLLB</name>
          <description>A/D Compare Function Window B Lower-Side Level Setting Register</description>
          <addressOffset>0x0A8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADWINLLB</name>
              <description>This register is used to compare A window function is used to set the lower level of the window B.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADWINULB</name>
          <description>A/D Compare Function Window B Upper-Side Level Setting Register</description>
          <addressOffset>0x0AA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADWINULB</name>
              <description>This register is used to compare A window function is used to set the higher level of the window B.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPBSR</name>
          <description>A/D Compare Function Window B Status Register</description>
          <addressOffset>0x0AC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CMPSTB</name>
              <description>Compare window B flag.It is a status flag that shows the comparative result of CH (AN000-AN027, temperature sensor, and internal reference voltage) made the object of window B relation condition.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Comparison conditions are not met.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Comparison conditions are met.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSSTRL</name>
          <description>A/D Sampling State Register L</description>
          <addressOffset>0x0DD</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0B</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SST</name>
              <description>Sampling Time Setting (AN016-AN027)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0x05</minimum>
                  <maximum>0xFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSSTRT</name>
          <description>A/D Sampling State Register T</description>
          <addressOffset>0x0DE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0B</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SST</name>
              <description>Sampling Time Setting (temperature sensor output)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0x05</minimum>
                  <maximum>0xFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSSTRO</name>
          <description>A/D Sampling State Register O</description>
          <addressOffset>0x0DF</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0B</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SST</name>
              <description>Sampling Time Setting (Internal reference voltage)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0x05</minimum>
                  <maximum>0xFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>ADSSTR[%s]</name>
          <description>A/D Sampling State Registers</description>
          <addressOffset>0x0E0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0B</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SST</name>
              <description>Sampling time setting</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0x05</minimum>
                  <maximum>0xFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
