arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>ADPGACR</name>
          <description>A/D Programmable Gain Amplifier Control Register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x9999</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>P002GEN</name>
              <description>PGA P002 gain setting and enable bit</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The gain setting is invalidated (AIN is not input in PGA). </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The gain setting is effectively done (AIN is input in PGA).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P002ENAMP</name>
              <description>Amplifier enable bit for PGA P002</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The amplifier in PGA is not used. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The amplifier in PGA is used. </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P002SEL1</name>
              <description>The amplifier passing is enable for PGA P002</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>By way of the amplifier in PGA. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Note 1 that by way of amplifier in PGA</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P002SEL0</name>
              <description>A through amplifier is enable for PGA P002</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not through the PGA in amplifier</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>I will through in the PGA amplifier.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="P002GEN">
              <name>P001GEN</name>
              <description>PGA P001 gain setting and enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field derivedFrom="P002ENAMP">
              <name>P001ENAMP</name>
              <description>Amplifier enable bit for PGA P001</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field derivedFrom="P002SEL1">
              <name>P001SEL1</name>
              <description>The amplifier passing is enable for PGA P001</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field derivedFrom="P002SEL0">
              <name>P001SEL0</name>
              <description>A through amplifier is enable for PGA P001</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field derivedFrom="P002GEN">
              <name>P000GEN</name>
              <description>PGA P000 gain setting and enable bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field derivedFrom="P002ENAMP">
              <name>P000ENAMP</name>
              <description>Amplifier enable bit for PGA P000</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field derivedFrom="P002SEL1">
              <name>P000SEL1</name>
              <description>The amplifier passing is enable for PGA P000</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field derivedFrom="P002SEL0">
              <name>P000SEL0</name>
              <description>A through amplifier is enable for PGA P000</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>P003SEL0</name>
              <description>A through amplifier is enable for PGA P003</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not through the PGA in amplifier</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>I will through in the PGA amplifier.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P003SEL1</name>
              <description>The amplifier passing is enable for PGA P003</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>By way of the amplifier in PGA. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Note 1 that by way of amplifier in PGA</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P003ENAMP</name>
              <description>Amplifier enable bit for PGA P003</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The amplifier in PGA is not used. </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The amplifier in PGA is used. </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P003GEN</name>
              <description>PGA P003 gain setting and enable bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The gain setting is invalidated (AIN is not input in PGA). </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The gain setting is effectively done (AIN is input in PGA).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADRD</name>
          <description>A/D Self-Diagnosis Data Register</description>
          <addressOffset>0xF8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>AD</name>
              <description>Converted Value 15 to 0</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADRST</name>
          <description>A/D Self-Diagnostic Status Register</description>
          <addressOffset>0xFA</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DIAGST</name>
              <description>Self-Diagnosis Status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Self-diagnosis has not been executed since power-on</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Self-diagnosis was executed under a condition that the ideal value of the A/D conversion result was 8000h</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Self-diagnosis was executed under a condition that an ideal value of the A/D conversion result was 0000h</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Self-diagnosis was executed under a condition than an ideal value of the A/D conversion result is 7FFFh</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VREFAMPCNT</name>
          <description>A/D Dedicated Reference Voltage Circuit Control Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VREFADCG</name>
              <description>VREFADC Output Voltage Control</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x</name>
                  <description>1.5 V</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>2.0 V</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>2.5 V</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFADCEN</name>
              <description>VREFADCG Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable the VREFADC output</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable the VREFADC output</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADSLP</name>
              <description>Sleep</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Standby</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OLDETEN</name>
              <description>OLDET Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable the over current detection.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable the over current detection.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGREN</name>
              <description>BGR Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Turn off power of BGR</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Turn on power of BGR</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCALEXE</name>
          <description>A/D Calibration Execution Register</description>
          <addressOffset>0xF2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CALEXE</name>
              <description>Calibration Start</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Calibration does not start</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Calibration starts</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALMON</name>
              <description>Calibration Status Flag</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Calibration not in progress</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Calibration in progress</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADANIM</name>
          <description>A/D Channel Input Mode Select Register</description>
          <addressOffset>0xF0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>1</dimIncrement>
              <name>ANIM%s</name>
              <description>Analog Channel Input Mode Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Single-end mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Differential mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
