arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>CTSUMCH1</name>
          <description>CTSU Measurement Channel Register 1</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CTSUMCH1</name>
              <description>CTSU Measurement Channel 1Note1: If  the value of CTSUMCH1 was set to b'111111, the measurement is stopped.</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TS0</name>
                  <description>measured TS0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS1</name>
                  <description>measured TS1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS2</name>
                  <description>measured TS2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS3</name>
                  <description>measured TS3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS4</name>
                  <description>measured TS4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS5</name>
                  <description>measured TS5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS6</name>
                  <description>measured TS6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS7</name>
                  <description>measured TS7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS8</name>
                  <description>measured TS8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS9</name>
                  <description>measured TS9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS10</name>
                  <description>measured TS10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS11</name>
                  <description>measured TS11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS12</name>
                  <description>measured TS12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS13</name>
                  <description>measured TS13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS14</name>
                  <description>measured TS14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS15</name>
                  <description>measured TS15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS16</name>
                  <description>measured TS16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS17</name>
                  <description>measured TS17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS18</name>
                  <description>measured TS18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS19</name>
                  <description>measured TS19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS20</name>
                  <description>measured TS20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS21</name>
                  <description>measured TS21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS22</name>
                  <description>measured TS22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS23</name>
                  <description>measured TS23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS24</name>
                  <description>measured TS24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS25</name>
                  <description>measured TS25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS26</name>
                  <description>measured TS26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS27</name>
                  <description>measured TS27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS28</name>
                  <description>measured TS28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS29</name>
                  <description>measured TS29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS30</name>
                  <description>measured TS30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS31</name>
                  <description>measured TS31</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS32</name>
                  <description>measured TS32</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS33</name>
                  <description>measured TS33</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS34</name>
                  <description>measured TS34</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS35</name>
                  <description>measured TS35</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Conversion Stopped</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>1</dimIncrement>
          <name>CTSUCHAC[%s]</name>
          <description>CTSU Channel Enable Control Register</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <name>TS%s</name>
              <description>CTSU Channel Enable Control </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Do not measure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Measure</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>1</dimIncrement>
          <name>CTSUCHTRC[%s]</name>
          <description>CTSU Channel Transmit/Receive Control Register</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <name>TS%s</name>
              <description>CTSU Channel Transmit/Receive Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Reception</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Transmission</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUDCLKC</name>
          <description>CTSU High-Pass Noise Reduction Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CTSUSSCNT</name>
              <description>CTSU Diffusion Clock Mode ControlNOTE: This bit  should be set to 11b.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSUSSMOD</name>
              <description>CTSU Diffusion Clock Mode SelectNOTE: This bit  should be set to 00b.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUST</name>
          <description>CTSU Status Register</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CTSUPS</name>
              <description>CTSU Mutual Capacitance Status Flag</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>First measurement</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Second measurement</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUROVF</name>
              <description>CTSU Reference Counter Overflow Flag</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No overflow</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An overflow</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUSOVF</name>
              <description>CTSU Sensor Counter Overflow Flag</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No overflow</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An overflow</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUDTSR</name>
              <description>CTSU Data Transfer Status Flag</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Measurement result has been read</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Measurement result has not been read</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUSTC</name>
              <description>CTSU Measurement Status Counter</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Status 0</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Status 1</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Status 2</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Status 3</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Status 4</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Status 5</description>
                  <value>#101</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUSSC</name>
          <description>CTSU High-Pass Noise Reduction Spectrum Diffusion Control Register </description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CTSUSSDIV</name>
              <description>CTSU Spectrum Diffusion Frequency Division Setting</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>4.00 &lt;= fb</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>2.00 &lt;= fb &lt; 4.00</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>1.33 &lt;= fb &lt; 2.00</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>1.00 &lt;= fb &lt; 1.33</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>0.80 &lt;= fb &lt; 1.00</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>0.67 &lt;= fb &lt; 0.80</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>0.57 &lt;= fb &lt; 0.67</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>0.50 &lt;= fb &lt; 0.57</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>0.44 &lt;= fb &lt; 0.50</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>0.40 &lt;= fb &lt; 0.44</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>0.36 &lt;= fb &lt; 0.40</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>0.33 &lt;= fb &lt; 0.36</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>0.31 &lt;= fb &lt; 0.33</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>0.29 &lt;= fb &lt; 0.31</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>0.27 &lt;= fb &lt; 0.29</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>fb &lt; 0.27</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUSO0</name>
          <description>CTSU Sensor Offset Register 0</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CTSUSNUM</name>
              <description>CTSU Measurement Count Setting</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSUSO</name>
              <description>CTSU Sensor Offset AdjustmentCurrent offset amount is CTSUSO ( 0 to 1023 )</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUSO1</name>
          <description>CTSU Sensor Offset Register 1</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CTSUICOG</name>
              <description>CTSU ICO Gain Adjustment</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>100 percent gain</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>66 percent gain</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>50 percent gain</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>40 percent gain</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSUSDPA</name>
              <description>CTSU Base Clock SettingOperating clock divided by ( CTSUSDPA + 1 ) x 2</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSURICOA</name>
              <description>CTSU Reference ICO Current AdjustmentCurrent offset amount is CTSUSO ( 0 to 255 )</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
