arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Current measurement mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCBACK</name>
              <description>CTSU Current Measurement Feedback Select</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>TSCAP pin is selected</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Measurement pin is selected</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUCRAL</name>
          <description>CTSU Control Register A</description>
          <alternateRegister>CTSUCRA</alternateRegister>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUCR0</name>
          <description>CTSU Control Register A</description>
          <alternateRegister>CTSUCRA</alternateRegister>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCR1</name>
          <description>CTSU Control Register A</description>
          <alternateRegister>CTSUCRA</alternateRegister>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCR2</name>
          <description>CTSU Control Register A</description>
          <alternateRegister>CTSUCRAH</alternateRegister>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCR3</name>
          <description>CTSU Control Register A</description>
          <alternateRegister>CTSUCRA</alternateRegister>
          <addressOffset>0x03</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCRB</name>
          <description>CTSU Control Register B</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>PRRATIO</name>
              <description>CTSU Measurement Time and Pulse Count Adjustment</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRMODE</name>
              <description>CTSU Base Period and Pulse Count Setting</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>510 pulses (512 pulses when PROFF bit is 1)</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>126 pulses (128 pulses when PROFF bit is 1)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>62 pulses (recommended setting) (64 pulses when PROFF bit is 1)</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFF</name>
              <description>CTSU High-Pass Noise Reduction Function Off Setting</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Turn spectrum diffusion on.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Turn spectrum diffusion off.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROFF</name>
              <description>CTSU Random Number Off Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>There is random number control.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>There is no random number control.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SST</name>
              <description>CTSU Sensor Stabilization Wait Control</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSMOD</name>
              <description>CTSU SUCLK Diffusion Mode Select</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSCNT</name>
              <description>CTSU SUCLK Diffusion Control</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTSUCRBL</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUSDPRS</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUSST</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
        <register>
          <name>CTSUCRBH</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xffff</resetMask>
        </register>
        <register>
          <name>CTSUDCLKC</name>
          <description>CTSU Control Register B</description>
          <alternateRegister>CTSUCRB</alternateRegister>
          <addressOffset>0x07</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xff</resetMask>
        </register>
