arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_DAC8</name>
      <description>8-Bit D/A Converter</description>
      <baseAddress>0x4009E000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x002</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000003</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000006</offset>
        <size>0x002</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DAM</name>
          <description>D/A Converter Mode Register</description>
          <addressOffset>0x03</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DACE1</name>
              <description>D/A operation enable 1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>D/A conversion disabled for channel 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>D/A conversion enabled for channel 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACE0</name>
              <description>D/A operation enable 0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>D/A conversion disabled for channel 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>D/A conversion enabled for channel 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAMD1</name>
              <description>D/A operation mode select 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Channel 1 for normal operation mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Channel 1 for real-time output mode(event link)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAMD0</name>
              <description>D/A operation mode select 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Channel 0 for normal operation mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Channel 0 for real-time output mode(event link)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x01</dimIncrement>
          <name>DACS[%s]</name>
          <description>D/A Conversion Value Setting Register %s</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DACS</name>
              <description>DACS D/A conversion store data </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DACADSCR</name>
          <description>D/A A/D Synchronous Start Control Register</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DACADST</name>
              <description>D/A A/D Synchronous Conversion</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Do not synchronize DAC8 with ADC16 operation (disable interference reduction between D/A and A/D conversion)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Synchronize DAC8 with ADC16 operation (enable interference reduction between D/A and A/D conversion).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DACPC</name>
          <description>D/A SW Charge Pump Control Register</description>
          <addressOffset>0x07</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PUMPEN</name>
              <description>Charge pump enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Charge pump disable</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Charge pump enable</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
