arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>COLOR1</name>
          <description>Base Color Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COLOR1A</name>
              <description>Alpha channel of color 1(0x00: transparent. . .  0xFF: opaque)</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>COLOR1R</name>
              <description>Red channel of color 1</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>COLOR1G</name>
              <description>Green channel of color 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>COLOR1B</name>
              <description>Blue channel of color 1</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COLOR2</name>
          <description>Secondary Color Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COLOR2A</name>
              <description>Alpha channel of color 2(0x00: transparent. . .   0xFF: opaque)</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>COLOR2R</name>
              <description>Red channel of color 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>COLOR2G</name>
              <description>Green channel of color 2</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>COLOR2B</name>
              <description>Blue channel of color 2</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATTERN</name>
          <description>Pattern Register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATTERN</name>
              <description>Bitmap of the pattern</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1-6</dimIndex>
          <name>L%sSTART</name>
          <description>Limiter %s Start Value Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LSTART</name>
              <description>Start value of the n'th limiter(n=1-6)</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1-6</dimIndex>
          <name>L%sXADD</name>
          <description>Limiter %s X-Axis Increment Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LXADD</name>
              <description>X-axis increment</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1-6</dimIndex>
          <name>L%sYADD</name>
          <description>Limiter %s Y-Axis Increment Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LYADD</name>
              <description>Y-axis increment</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2</dimIndex>
          <name>L%sBAND</name>
          <description>Limiter %s Band Width Parameter Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LBAND</name>
              <description>Limiter m band width parameter</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEXORIGIN</name>
          <description>Texture Base Address Register </description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEXORIGIN</name>
              <description>Texture base address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEXPITCH</name>
          <description>Texels Per Texture Line Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEXPITCH</name>
              <description>Texels per texture linevalid range: 0 to 2048</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEXMASK</name>
          <description>Texture Size or Texture Address Mask Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEXVMASK</name>
              <description>V maskSet TEXVMASK[20:0] = TEXPITCH * (texture_height - 1).In texture wrapping mode (CONTROL2.TEXTURECLAMPY = 0): texture_height must be a power of 2In texture clamping mode (CONTROL2.TEXTURECLAMPY = 1):all heights up to 1024 are allowed.</description>
              <lsb>11</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TEXUMASK</name>
              <description>U maskSet TEXUMASK[10:0] = texture_width -1In texture wrapping mode (CONTROL2.TEXTURECLAMPX = 0): texture_width must be a power of 2.In texture clamping mode (CONTROL2.TEXTURECLAMPX = 1):all widths up to 2048 are allowed.</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUSTART</name>
          <description>U Limiter Start Value Register </description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUSTART</name>
              <description>U limiter start value</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUXADD</name>
          <description>U Limiter X-Axis Increment Register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUXADD</name>
              <description>U limiter x-axis increment</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUYADD</name>
          <description>U Limiter Y-Axis Increment Register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUYADD</name>
              <description>U limiter y-axis increment</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVSTARTI</name>
          <description>V Limiter Start Value Integer Part Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVSTARTI</name>
              <description>V limiter start value integer part</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVSTARTF</name>
          <description>V Limiter Start Value Fractional Part Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVSTARTF</name>
              <description>V limiter start value fractional part</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVXADDI</name>
          <description>V Limiter X-Axis Increment Integer Part Register</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVXADDI</name>
              <description>V limiter x-axis increment integer part</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVYADDI</name>
          <description>V Limiter Y-Axis Increment Integer Part Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVYADDI</name>
              <description>V limiter y-axis increment integer part</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVYXADDF</name>
          <description>V Limiter Increment Fractional Parts Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVYADDF</name>
              <description>V y limiter increment fractional part</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>LVXADDF</name>
              <description>V xlimiter increment fractional part</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEXCLADDR</name>
          <description>CLUT Start Address Register</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLADDR</name>
              <description>Texture CLUT start address for indexed texture format</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEXCLDATA</name>
          <description>CLUT Data Register</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLDATA</name>
              <description>Texture CLUT data for Indexed texture format</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEXCLOFFSET</name>
          <description>CLUT Offset Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLOFFSET</name>
              <description>Texture CLUT offset for Indexed texture format. CLOFFSET[7:0] is or'ed with the original index</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COLKEY</name>
          <description>Color Key Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COLKEYR</name>
              <description>Red channel of color key</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>COLKEYG</name>
              <description>Green channel of color key</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>COLKEYB</name>
              <description>Blue channel of color key</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIZE</name>
          <description>Bounding Box Dimension Register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIZEY</name>
              <description>Height of the bounding box in pixelsvalid range: 0 to 1024</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SIZEX</name>
              <description> Width of the bounding box in pixelsvalid range: 0 to 1024</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PITCH</name>
          <description>Framebuffer Pitch And Spanstore Delay Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSD</name>
              <description>Spanstore delay</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>PITCH</name>
              <description>pitch of the framebuffer. A negative width can be used to render bottom-up instead of top-down</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORIGIN</name>
          <description>Framebuffer Base Address Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ORIGIN</name>
              <description>Address of the first pixel in framebuffer</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLISTSTART</name>
          <description>Display List Start Address Register</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLISTSTART</name>
              <description>Display list start address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
