arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>PERFTRIGGER</name>
          <description>Performance Counters Control Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERFTRIGGER2</name>
              <description>Selects the internal event that will increment PERFCOUNT2 register</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>disable performance counter </description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x01</name>
                  <description>2D Drawing Engine active cycles </description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>framebuffer read access </description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x03</name>
                  <description>framebuffer write access </description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>texture read access </description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>invisible pixels (enumerated but selected with alpha 0percent) </description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>invisible pixels while internal FIFO is empty (lost cycles) </description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>display list reader active cycles </description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>framebuffer read hits</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>framebuffer read misses</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>framebuffer write hits </description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>framebuffer write misses </description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>texture read hits </description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>texture read misses </description>
                  <value>0x0D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1F</name>
                  <description>every clock cycle (for use as timer) </description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERFTRIGGER1</name>
              <description>Selects the internal event that will increment PERFCOUNT1 register.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>disable performance counter </description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x01</name>
                  <description>2D Drawing Engine active cycles </description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>framebuffer read access </description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x03</name>
                  <description>framebuffer write access </description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>texture read access </description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>invisible pixels (enumerated but selected with alpha 0percent) </description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>invisible pixels while internal FIFO is empty (lost cycles) </description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>display list reader active cycles </description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>framebuffer read hits</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>framebuffer read misses</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>framebuffer write hits </description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>framebuffer write misses </description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>texture read hits </description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>texture read misses </description>
                  <value>0x0D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1F</name>
                  <description>every clock cycle (for use as timer) </description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2</dimIndex>
          <name>PERFCOUNT%s</name>
          <description>Performance Counter %s</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERFCOUNT</name>
              <description>Counter value.The counter is reset by writing PERFCOUNT = 0000 0000H.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
