arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_ETHERC_EDMAC</name>
      <description>Ethernet DMA Controller</description>
      <baseAddress>0x40114000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000008</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000010</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000018</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000020</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000028</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000030</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000038</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000040</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000048</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000050</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000058</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000064</offset>
        <size>0x010</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000078</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000C8</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000D4</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EDMR</name>
          <description>EDMAC Mode Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DE</name>
              <description>Big Endian Mode/Little Endian ModeNOTE: This setting applies to data for the transmit/receive buffer. It does not apply to transmit/receive descriptors and registers.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Big endian mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Little endian mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DL</name>
              <description>Transmit/Receive DescriptorLength</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>16 bytes</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>32 bytes</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>64 bytes</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>16 bytes</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>no effect.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>the corresponding channels of the EDMAC and ETHERC are reset.  Registers TDLAR, RDLAR, RMFCR, TFUCR, and RFOCR are not reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EDTRR</name>
          <description>EDMAC Transmit Request Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TR</name>
              <description>Transmit Request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>no effect.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>When 1 is written, the EDMAC reads the corresponding descriptor and transmits frames where the TD0.TACT bit is 1. The TR bit becomes 0 after all the valid frames are transmitted. </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EDRRR</name>
          <description>EDMAC Receive Request Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RR</name>
              <description>Receive Request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Receive function is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Receive descriptor is read, and the receive function is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TDLAR</name>
          <description>Transmit Descriptor List Start Address Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDLAR</name>
              <description>The start address of the transmit descriptor list is set. Set the start address according to the descriptor length selected by the EDMR.DL[1:0] bits.16-byte boundary: Lower 4 bits = 0000b32-byte boundary: Lower 5 bits = 00000b64-byte boundary: Lower 6 bits = 000000b</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDLAR</name>
          <description>Receive Descriptor List Start Address Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDLAR</name>
              <description>The start address of the receive descriptor list is set. Set the start address according to the descriptor length selected by the EDMR.DL[1:0] bits.16-byte boundary: Lower 4 bits = 0000b32-byte boundary: Lower 5 bits = 00000b64-byte boundary: Lower 6 bits = 000000b</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
