arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>SYIPADDRR</name>
          <description>SYNFP Local IP Address Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYIPADDRR</name>
              <description>These bits hold the setting for the local IP address.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPVRR</name>
          <description>SYNFP Specification Version Setting Register</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRSP</name>
              <description>transportSpecific Field ValueThese bits are used to set the transportSpecific field value of the PTP v2 header.When a message is received, this value is compared with the transportSpecific field of the received frame.In generating messages, the value is used for the transportSpecific field of the frame for transmission.Set these bits to 0000b (IEEE 1588).</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VER</name>
              <description>versionPTP Field ValueThese bits are used to set the versionPTP field value of the PTP v2 header.When a message is received, this value is compared with the versionPTP field of the received frame.In generating messages, the value is used for the versionPTP field of the frame for transmission.Set these bits to 0010b (PTP v2).</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYDOMR</name>
          <description>SYNFP Domain Number Setting Register</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DNUM</name>
              <description>domainNumber Field Value SettingThese bits are used to set the domainNumber field value of the PTP v2 header.When a message is received, this value is compared with the domainNumber field of the received frame as a condition for PTP reception processing.In generating messages, the value is used for the domainNumber field of the frame for transmission.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANFR</name>
          <description>Announce Message Flag Field Setting Register</description>
          <addressOffset>0x050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLAG14</name>
              <description>PTP profile Specific 2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PTP profile Specific 2 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PTP profile Specific 2 is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG13</name>
              <description>PTP profile Specific 1</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PTP profile Specific 1 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PTP profile Specific 1 is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG10</name>
              <description>unicastFlag</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>unicastFlag is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>unicastFlag is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG8</name>
              <description>alternateMasterFlag</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>alternateMasterFlag is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>alternateMasterFlag is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG5</name>
              <description>frequencyTraceableThis bit is used to set the logical value of the frequencyTraceable member of timePropertiesDS.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>frequencyTraceable is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>frequencyTraceable is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG4</name>
              <description>timeTraceableThis bit is used to set the logical value of the timeTraceable member of timePropertiesDS.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>timeTraceable is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>timeTraceable is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG3</name>
              <description>ptpTimescaleThis bit is used to set the logical value of the ptpTimescale member of timePropertiesDS.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ptpTimescale is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ptpTimescale is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG2</name>
              <description>currentUtcOffsetValidThis bit is used to set the logical value of the currentUtcOffsetValid member of timePropertiesDS.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>currentUtcOffsetValid is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>currentUtcOffsetValid is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG1</name>
              <description>leap59This bit is used to set the logical value of the leap59 member of timePropertiesDS.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>leap59 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>leap59 is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG0</name>
              <description>leap61This bit is used to set the logical value of the leap61 member of timePropertiesDS.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>leap61 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>leap61 is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNFR</name>
          <description>Sync Message Flag Field Setting Register</description>
          <addressOffset>0x054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLAG14</name>
              <description>PTP profile Specific 2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PTP profile Specific 2 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PTP profile Specific 2 is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG13</name>
              <description>PTP profile Specific 1</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PTP profile Specific 1 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PTP profile Specific 1 is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG10</name>
              <description>unicastFlag</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>unicastFlag is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>unicastFlag is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG9</name>
              <description>twoStepFlag</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Set this bit to 0 (FALSE).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Setting prohibited</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG8</name>
              <description>alternateMasterFlag</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>alternateMasterFlag is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>alternateMasterFlag is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DYRQFR</name>
          <description>Delay_Req Message Flag Field Setting Register</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLAG14</name>
              <description>PTP profile Specific 2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PTP profile Specific 2 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PTP profile Specific 2 is set to TRULE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG13</name>
              <description>PTP profile Specific 1</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PTP profile Specific 1 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PTP profile Specific 1 is set to TRULE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG10</name>
              <description>unicastFlag</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>unicastFlag is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>unicastFlag is set to TRULE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DYRPFR</name>
          <description>Delay_Resp Message Flag Field Setting Register</description>
          <addressOffset>0x05C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLAG14</name>
              <description>PTP profile Specific 2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PTP profile Specific 2 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PTP profile Specific 2 is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG13</name>
              <description>PTP profile Specific 1</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PTP profile Specific 1 is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PTP profile Specific 1 is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG10</name>
              <description>unicastFlag</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>unicastFlag is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>unicastFlag is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG9</name>
              <description>woStepFlag</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Set this bit to 0 (FALSE).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Setting prohibited</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLAG8</name>
              <description>alternateMasterFlag</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>alternateMasterFlag is set to FALSE.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>alternateMasterFlag is set to TRUE.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYCIDRU</name>
          <description>SYNFP Local Clock ID Registers</description>
          <addressOffset>0x060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYCIDRU</name>
              <description>These bits hold the setting for the higher-order 32 bits of the clock-ID of your port.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYCIDRL</name>
          <description>SYNFP Local Clock ID Registers</description>
          <addressOffset>0x064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYCIDRL</name>
              <description>These bits hold the setting for the lower-order 32 bits of the clock-ID of your port.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
