arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>SYPNUMR</name>
          <description>SYNFP Local Port Number Register</description>
          <addressOffset>0x068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PNUM</name>
              <description>Local Port Number SettingThese bits hold the setting for the port number of the local port.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYRVLDR</name>
          <description>SYNFP Register Value Load Directive Register</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANUP</name>
              <description>Announce Message Generation Information Update</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>no effect</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Setting this bit to 1 leads to simultaneous reflection in the Announce message generation block of the values of the registers required for the generation of Announce messages.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STUP</name>
              <description>State Update</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>no effect</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Setting this bit to 1 leads to simultaneous reflection in the SYNFP module of the values of the registers related to the reception and transmission of PTP messages.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BMUP</name>
              <description>BMC Update</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>no effect</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Setting this bit to 1 leads to simultaneous reflection in the SYNFP module of the values of the registers holding the MasterClock identifying information.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYRFL1R</name>
          <description>SYNFP Reception Filter Register 1</description>
          <addressOffset>0x090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDFUP2</name>
              <description>Pdelay_Resp_Follow_Up Message Processing</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The SYNFP does not process messages.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The SYNFP does not process messages.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDFUP1</name>
              <description>Pdelay_Resp_Follow_Up Message Processing</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The PRC-TC does not relay messages between ports 0 and 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The PRC-TC relays messages between ports 0 and 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDFUP0</name>
              <description>Pdelay_Resp_Follow_Up Message Processing</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Messages are not transferred to the PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Messages are transferred to the PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDRP2</name>
              <description>Pdelay_Resp Message Processing</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The SYNFP does not process messages.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The SYNFP processes messages.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDRP1</name>
              <description>Pdelay_Resp Message Processing</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The PRC-TC does not relay messages between ports 0 and 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The PRC-TC relays messages between ports 0 and 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDRP0</name>
              <description>Pdelay_Resp Message Processing</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Messages are not transferred to the PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Messages are transferred to the PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDRQ2</name>
              <description>Pdelay_Req Message Processing</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The SYNFP does not process messages.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The SYNFP processes messages.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDRQ1</name>
              <description>Pdelay_Req Message Processing</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The PRC-TC does not relay messages between ports 0 and 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The PRC-TC relays messages between ports 0 and 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDRQ0</name>
              <description>Pdelay_Req Message Processing</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Messages are not transferred to the PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Messages are transferred to the PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRP2</name>
              <description>Delay_Resp Message Processing</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The SYNFP does not process messages.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The SYNFP processes messages.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRP1</name>
              <description>Delay_Resp Message Processing</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The PRC-TC does not relay messages between ports 0 and 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The PRC-TC relays messages between ports 0 and 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRP0</name>
              <description>Delay_Resp Message Processing</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Messages are not transferred to the PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Messages are transferred to the PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRQ2</name>
              <description>Delay_Req Message Processing</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The SYNFP does not process messages.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The SYNFP processes messages.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRQ1</name>
              <description>Delay_Req Message Processing</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The PRC-TC does not relay messages between ports 0 and 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The PRC-TC relays messages between ports 0 and 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRQ0</name>
              <description>Delay_Req Message Processing</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Messages are not transferred to the PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Messages are transferred to the PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUP2</name>
              <description>Follow_Up Message Processing</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The SYNFP does not process messages.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The SYNFP processes messages.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUP1</name>
              <description>Follow_Up Message Processing</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The PRC-TC does not relay messages between ports 0 and 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The PRC-TC relays messages between ports 0 and 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUP0</name>
              <description>Follow_Up Message Processing</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Messages are not transferred to the PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Messages are transferred to the PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC2</name>
              <description>Sync Message Processing</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The SYNFP does not process messages.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The SYNFP processes messages.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC1</name>
              <description>Sync Message Processing</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The PRC-TC does not relay messages between ports 0 and 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The PRC-TC relays messages between ports 0 and 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC0</name>
              <description>Sync Message Processing</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Messages are not transferred to the PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Messages are transferred to the PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANCE1</name>
              <description>Announce Message Processing</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The PRC-TC does not relay messages between ports 0 and 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The PRC-TC relays messages between ports 0 and 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANCE0</name>
              <description>Announce Message Processing</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Messages are not transferred to the PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Messages are transferred to the PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
