arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_ETHERC_EPTPC_COMMON</name>
      <description>Ethernet PTP Controller Common</description>
      <baseAddress>0x40065000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000010</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000040</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000050</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000060</offset>
        <size>0x010</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000080</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000090</offset>
        <size>0x010</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000B0</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000124</offset>
        <size>0x020</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000170</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000210</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000002D0</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000300</offset>
        <size>0x060</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000037C</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000400</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000410</offset>
        <size>0x014</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000430</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>TM[%s]</name>
          <description>Timer Setting Registers</description>
          <addressOffset>0x300</addressOffset>
          <register>
            <name>STTRU</name>
            <description>Timer Start Time Setting Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TMSTTRU</name>
                <description>These bits hold the setting for the higher-order 32 bits of the start time of the pulse output timer in nanoseconds.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STTRL</name>
            <description>Timer Start Time Setting Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TMSTTRL</name>
                <description>These bits hold the setting for the lower-order 32 bits of the start time of the pulse output timer in nanoseconds.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CYCR</name>
            <description>Timer Cycle Setting Registers</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TMCYCR</name>
                <description>These bits set the cycle of the pulse output timer in nanoseconds. Set a value that is equivalent to at least four cycles of the STCA clock.</description>
                <lsb>0</lsb>
                <msb>29</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PLSR</name>
            <description>Timer Pulse Width Setting Register</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TMPLSR</name>
                <description>These bits set the width at high level of the pulse signal from the timer in nanoseconds. Set a value that is equivalent to at least two cycles of the STCA clock.</description>
                <lsb>0</lsb>
                <msb>28</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>PR[%s]</name>
          <description>Local MAC Address Registers</description>
          <addressOffset>0x410</addressOffset>
          <register>
            <name>MACRU</name>
            <description>Channel Local MAC Address Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMACRU</name>
                <description>These bits hold the setting for the higher-order 24 bits of the local MAC address for Ethernet port 0.</description>
                <lsb>0</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MACRL</name>
            <description>Channel Local MAC Address Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRMACRL</name>
                <description>These bits hold the setting for the higher-order 24 bits of the local MAC address for Ethernet port 0.</description>
                <lsb>0</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>MIESR</name>
          <description>MINT Interrupt Source Status Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYC5</name>
              <description>Pulse Output Timer 5 Rising Edge Detection Flag</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 5 is not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 5 is detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC4</name>
              <description>Pulse Output Timer 4 Rising Edge Detection Flag</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 4 is not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 4 is detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC3</name>
              <description>Pulse Output Timer 3 Rising Edge Detection Flag</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 3 is not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 3 is detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC2</name>
              <description>Pulse Output Timer 2 Rising Edge Detection Flag</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 2 is not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 2 is detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC1</name>
              <description>Pulse Output Timer 1 Rising Edge Detection Flag</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 1 is not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 1 is detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC0</name>
              <description>Pulse Output Timer 0 Rising Edge Detection Flag</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 0 is not detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A rising edge in the periodic pulse signal from pulse output timer 0 is detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRC</name>
              <description>PRC-TC Status Flag</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No change in the state of the PRC-TC module</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A change in the state of the PRC-TC module</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SY1</name>
              <description>SYNFP1 Status Flag</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No change in the state of the SYNFP1 module</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A change in the state of the SYNFP1 module</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SY0</name>
              <description>SYNFP0 Status Flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No change in the state of the SYNFP0 module</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A change in the state of the SYNFP0 module</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ST</name>
              <description>STCA Status Flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No change in the state of the STCA module</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A change in the state of the STCA module</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
