arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>MIEIPR</name>
          <description>MINT Interrupt Request Permission Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYC5</name>
              <description>Pulse Output Timer 5 Rising Edge Detection Interrupt Request Permission</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 5.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 5.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC4</name>
              <description>Pulse Output Timer 4 Rising Edge Detection Interrupt Request Permission</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 4.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 4.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC3</name>
              <description>Pulse Output Timer 3 Rising Edge Detection Interrupt Request Permission</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 3.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 3.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC2</name>
              <description>Pulse Output Timer 2 Rising Edge Detection Interrupt Request Permission</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 2.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 2.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC1</name>
              <description>Pulse Output Timer 1 Rising Edge Detection Interrupt Request Permission</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYC0</name>
              <description>Pulse Output Timer 0 Rising Edge Detection Interrupt Request Permission</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests in response to detection of a rising edge of pulse output timer 0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRC</name>
              <description>PRC-TC Status Interrupt Request Permission</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests by the PRC-TC status flag.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests by the PRCTC status flag.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SY1</name>
              <description>SYNFP1 Status Interrupt Request Permission</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests by the SYNFP1 status flag.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests by the SYNFP1 status flag.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SY0</name>
              <description>SYNFP0 Status Interrupt Request Permission</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests by the SYNFP0 status flag.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests by the SYNFP0 status flag.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ST</name>
              <description>STCA Status Interrupt Request Permission</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits the generation of MINT interrupt requests by the STCA status flag.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits the generation of MINT interrupt requests by the STCA status flag.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ELIPPR</name>
          <description>ELC Output/ETHER_IPLS Interrupt Request Permission Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00003F3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLSN</name>
              <description>Pulse Output Timer Falling Edge Detection IPLS Interrupt Request Permission</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits IPLS interrupt requests due to falling edges of signals from the selected pulse output timer.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits IPLS interrupt requests due to falling edges of signals from the selected pulse output timer.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLSP</name>
              <description>Pulse Output Timer Rising Edge Detection IPLS Interrupt Request Permission</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits IPLS interrupt requests due to rising edges of signals from the selected pulse output timer.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits IPLS interrupt requests due to rising edges of signals from the selected pulse output timer.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCN5</name>
              <description>Pulse Output Timer 5 Falling Edge Detection Event Output Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Falling edges of the signal from pulse output timer 5 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Falling edges of the signal from pulse output timer 5 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCN4</name>
              <description>Pulse Output Timer 4 Falling Edge Detection Event Output Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Falling edges of the signal from pulse output timer 4 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Falling edges of the signal from pulse output timer 4 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCN3</name>
              <description>Pulse Output Timer 3 Falling Edge Detection Event Output Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Falling edges of the signal from pulse output timer 3 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Falling edges of the signal from pulse output timer 3 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCN2</name>
              <description>Pulse Output Timer 2 Falling Edge Detection Event Output Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Falling edges of the signal from pulse output timer 2 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Falling edges of the signal from pulse output timer 2 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCN1</name>
              <description>Pulse Output Timer 1 Falling Edge Detection Event Output Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Falling edges of the signal from pulse output timer 1 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Falling edges of the signal from pulse output timer 1 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCN0</name>
              <description>Pulse Output Timer 0 Falling Edge Detection Event Output Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Falling edges of the signal from pulse output timer 0 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Falling edges of the signal from pulse output timer 0 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCP5</name>
              <description>Pulse Output Timer 5 Rising Edge Detection Event Output Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Rising edges of the signal from pulse output timer 5 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Rising edges of the signal from pulse output timer 5 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCP4</name>
              <description>Pulse Output Timer 4 Rising Edge Detection Event Output Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Rising edges of the signal from pulse output timer 4 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Rising edges of the signal from pulse output timer 4 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCP3</name>
              <description>Pulse Output Timer 3 Rising Edge Detection Event Output Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Rising edges of the signal from pulse output timer 3 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Rising edges of the signal from pulse output timer 3 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCP2</name>
              <description>Pulse Output Timer 2 Rising Edge Detection Event Output Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Rising edges of the signal from pulse output timer 2 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Rising edges of the signal from pulse output timer 2 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCP1</name>
              <description>Pulse Output Timer 1 Rising Edge Detection Event Output Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Rising edges of the signal from pulse output timer 1 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Rising edges of the signal from pulse output timer 1 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCP0</name>
              <description>Pulse Output Timer 0 Rising Edge Detection Event  Output Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Rising edges of the signal from pulse output timer 0 are not conveyed to the ELC as event signals.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Rising edges of the signal from pulse output timer 0 are conveyed to the ELC as event signals.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
