arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>FAWMON</name>
          <description>Flash Access Window Monitor</description>
          <addressOffset>0x0DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BTFLG</name>
              <description>Flag of Start-Up area select for Boot Swap</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The start-up area is the alternate area (sector 1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The start-up area is the default area (sector 0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAWE</name>
              <description>End Sector Address for Access Window
  NOTE: These bits indicate the end sector address for setting the access window that is located in the configuration area.</description>
              <lsb>16</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FSPR</name>
              <description>Protection Flag of programming the Access Window, Boot Flag and Temporary Boot Swap Control and "Config Clear" command execution</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Protected state</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Non-protected state</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAWS</name>
              <description>Start Sector Address for Access Window
  NOTE: These bits indicate the start sector address for setting the access window that is located in the configuration area. </description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCPSR</name>
          <description>FCU Process Switch</description>
          <addressOffset>0x00E0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ESUSPMD</name>
              <description>Erasure-Suspended Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Suspension-priority mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Erasure-priority mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCKAR</name>
          <description>Flash Sequencer Processing Clock Frequency Notification</description>
          <addressOffset>0x00E4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY Code</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x1E</name>
                  <description>Writing to the other bits in this register is enabled.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Writing to the other bits in this register is disabled.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCKA</name>
              <description>Flash Sequencer Processing Clock Frequency
  These bits can be written when FRDY bit in FSTATR register is "1". Writing to this bit in FRDY = "0" is ignored.
  Writing to these bits is enabled only when this register is accessed in 16-bit size and H'1E is written to KEY bits.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>others</name>
                  <description>Notifies operating frequency of clkf.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSUACR</name>
          <description>Flash Start-Up Area Control Register</description>
          <addressOffset>0x00E8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY Code</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x66</name>
                  <description>Writing to the other bits in this register is enabled.</description>
                  <value>0x66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Writing to the other bits in this register is disabled.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAS</name>
              <description>Start Up Area Select
  These bits can be written when FRDY bit in FSTATR register is "1". Writing to this bit in FRDY = "0" is ignored.
  Writing to these bits is enabled only when this register is accessed in 16-bit size and H'66 is written to KEY bits.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>10</name>
                  <description>The start-up area is temporarily switched to the default area (sector 0) regardless of the BTFLG bit. When a reset is generated after setting, the start-up area is selected according to the BTFLG bit.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>The start-up area is temporarily switched to the alternate area (sector 1) regardless of the BTFLG bit. When a reset is generated after setting, the start-up area is selected according to the BTFLG bit.</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>The start-up area is selected according to the start-up area setting of the configuration area (BTFLG bit).</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
