arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_FACI_LP</name>
      <description>Flash Application Command Interface</description>
      <baseAddress>0x407EC000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DFLCTL</name>
          <description>Flash P/E Mode Control Register</description>
          <addressOffset>0x090</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <register>
          <name>FPMCR</name>
          <description>Flash P/E Mode Control Register</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x08</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>FMS2</name>
              <description>Flash Operating Mode Select 2.
Refer to the description of the FMS0 bit.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VLPE</name>
              <description>Low-Voltage P/E Mode Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Low-voltage programming is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Low-voltage programming is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMS1</name>
              <description>The bit to make data flash a programming mode
Refer to the description of the FMS0 bit.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RPDIS</name>
              <description>Code Flash P/E Disable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The programming of the code flash is enabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The programming of the code flash is disabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMS0</name>
              <description>Flash Operating Mode Select 0
FMS2,1,0:
     000: Read mode
     011: Discharge mode 1
     111: Discharge mode 2
     101: Code Flash P/E mode
     010: Data flash P/E mode
     Others: Setting prohibited.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FASR</name>
          <description>Flash Area Select Register</description>
          <addressOffset>0x104</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>EXS</name>
              <description>Extra area select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>User area or data area</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Extra area</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSARL</name>
          <description>Flash Processing Start Address Register L</description>
          <addressOffset>0x108</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FSAR15_0</name>
              <description>Start address</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSARH</name>
          <description>Flash Processing Start Address Register H</description>
          <addressOffset>0x110</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FSAR31_25</name>
              <description>Start address</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FSAR20_16</name>
              <description>Start address</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <description>Flash Control Register</description>
          <addressOffset>0x114</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>OPST</name>
              <description>Processing Start</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Processing stops.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Processing starts.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>Forced Processing Stop</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DRC</name>
              <description>Data Read Completion</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data is not read or next data is requested.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Data reading is completed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD</name>
              <description>Software Command Setting</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Program</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Blank check </description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Block erase </description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Consecutive read</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Chip erase</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FEARL</name>
          <description>Flash Processing End Address Register L</description>
          <addressOffset>0x118</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FEAR15_0</name>
              <description>End address</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEARH</name>
          <description>Flash Processing End Address Register H</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEAR31_25</name>
              <description>End address</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FEAR20_16</name>
              <description>End address</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRESETR</name>
          <description>Flash Reset Register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRESET</name>
              <description>Software Reset of the registers</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No effect</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The registers relates to the flash programming are reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSTATR00</name>
          <description>Flash Status Register00</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFEF</resetMask>
          <fields>
            <field>
              <name>EILGLERR</name>
              <description>Extra Area Illegal Command Error Flag</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No illegal command or illegal access to the extra area is detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An illegal command or illegal access to the extra area is detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ILGLERR</name>
              <description>Illegal Command Error Flag</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No illegal software command or illegal access is detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An illegal command or illegal access is detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCERR0</name>
              <description>Blank Check Error Flag0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Blank checking terminates normally.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An error occurs during blank checking.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRGERR01</name>
              <description>Program Error Flag 01</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Programming by the FEXCR register terminates normally.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An error occurs during programming.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRGERR0</name>
              <description>Program Error Flag0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Programming terminates normally.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An error occurs during programming.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERERR0</name>
              <description>Erase Error Flag0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Erasure terminates normally.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An error occurs during erasure.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSTATR1</name>
          <description>Flash Status Register1</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFB</resetMask>
          <fields>
            <field>
              <name>EXRDY</name>
              <description>End status signal of a Extra programming sequencer</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Other than below</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The software command of the FEXCR register is terminated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRDY</name>
              <description>End status signal of a sequencer</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Other than below</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The software command of the FCR register is terminated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRRDY</name>
              <description>Data read request</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Other than below</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The read processing of the consecutive read command at each address is terminated and read data is stored to the FRBH and FRBL registers.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FWBL0</name>
          <description>Flash Write Buffer Register L0</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDATA</name>
              <description>Program data of the program command</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FWBH0</name>
          <description>Flash Write Buffer Register H0</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDATA</name>
              <description>Program data of the program command</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSTATR01</name>
          <description>Flash Status Register01</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BCERR1</name>
              <description>Blank Check Error Flag1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Blank checking terminates normally.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An error occurs during blank checking.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRGERR1</name>
              <description>Program Error Flag1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Programming terminates normally.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An error occurs during programming.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERERR1</name>
              <description>Erase Error Flag1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Erasure terminates normally.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An error occurs during erasure.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
