arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
          <register>
            <name>SET</name>
            <description>Output Control Block Output Interface Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENDIANON</name>
                <description>Bit endian change control</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Ascending order (big endian)</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Descending order (little endian)</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWAPON</name>
                <description>Pixel order control</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In the order of BGR</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In the order of RGB</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORMAT</name>
                <description>Output format select</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Serial RGB; select RGB888 as dither output format.</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>RGB565; select RGB565 as dither output format.</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>RGB666; select RGB666 as dither output format.</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>RGB888; select RGB888 as dither output format.</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FRQSEL</name>
                <description>Clock frequency division control</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Setting prohibited</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>Quarter frequency (serial RGB)</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Setting prohibited</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>No frequency division, parallel RGB</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIRSEL</name>
                <description>Invalid data position control in serial RGB format</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Invalid data is output prior to valid (RGB) data.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Invalid data is output following valid (RGB) data.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PHASE</name>
                <description>Data delay in serial RGB format (based on OUTCLK)</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>3 cycles</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>2 cycles</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>1 cycle</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>0 cycle</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BRIGHT1</name>
            <description>Output Control Block Brightness Correction Register 1</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BRTG</name>
                <description>
									Brightness (DC) adjustment of G signal
									Unsigned; 10 bits; +512 with offset; integer
								</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BRIGHT2</name>
            <description>Output Control Block Brightness Correction Register 2</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BRTB</name>
                <description>
									Brightness (DC) adjustment of B signal
									Unsigned; 10 bits; +512 with offset; integer
								</description>
                <lsb>16</lsb>
                <msb>25</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>BRTR</name>
                <description>
									Brightness (DC) adjustment of R signal
									Unsigned; 10 bits; +512 with offset; integer
								</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTRAST</name>
            <description>Output Control Block Contrast Correction Register</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CONTG</name>
                <description>
									Contrast (GAIN) adjustment of G signal
									Unsigned; 8 bits fixed point.
								</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CONTG</name>
                    <description>CONTG/128</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONTB</name>
                <description>
									Contrast (GAIN) adjustment of B signal
									Unsigned; 8 bits fixed point
								</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CONTB</name>
                    <description>CONTB/128</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONTR</name>
                <description>
									Contrast (GAIN) adjustment of R signal
									Unsigned; 8 bits fixed point
								</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CONTR</name>
                    <description>CONTR/128</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PDTHA</name>
            <description>Output Control Block Panel Dither Correction Register</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SEL</name>
                <description>Operation mode</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Setting prohibited</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>2x2 pattern dither</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Round-off</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>Truncate</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORM</name>
                <description>Output format select</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Setting prohibited</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>RGB565; select RGB565 as output interface format.</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>RGB666; select RGB666 as output interface format.</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>RGB888; select RGB888 or serial RGB as output interface format.</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PA</name>
                <description>
									Pattern value (A) of 2 x 2 pattern dither
									Unsigned 2-bit integer
								</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>PB</name>
                <description>
									Pattern value (B) of 2 x 2 pattern dither
									Unsigned 2-bit integer
								</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>PC</name>
                <description>
									Pattern value (C) of 2 x 2 pattern dither
									Unsigned 2-bit integer
								</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>PD</name>
                <description>
									Pattern value (D) of 2 x 2 pattern dither
									Unsigned 2-bit integer
								</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKPHASE</name>
            <description>Output Control Block Output Phase Control Register</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FRONTGAM</name>
                <description>Correction control</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Gamma correction is followed by brightness/contrast correction.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Brightness/contrast correction is followed by gamma correction.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LCDEDGE</name>
                <description>LCD_DATA Output Phase Control</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCON0EDGE</name>
                <description>LCD_TCON0 Output Phase Control</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCON1EDGE</name>
                <description>LCD_TCON1 Output Phase Control</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCON2EDGE</name>
                <description>LCD_TCON2 Output Phase Control</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCON3EDGE</name>
                <description>LCD_TCON3 Output Phase Control</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>In synchronization with the falling edge of LCD_CLK.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>In synchronization with the rising edge of LCD_CLK.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TCON</name>
          <description>Timing Control Registers</description>
          <addressOffset>0x1400</addressOffset>
          <register>
            <name>TIM</name>
            <description>TCON Reference Timing Setting Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HALF</name>
                <description>
									Vertical synchronization signal generation change timing
									Sets the delay from the assertion of the internal horizontal synchronization signal in terms of pixels.
								</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HALF</name>
                    <description>HALF pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OFFSET</name>
                <description>
									Horizontal synchronization signal generation reference timing
									Sets the offset from the assertion of the internal horizontal synchronization signal in terms of pixels.
								</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFFSET</name>
                    <description>OFFSET+1 pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
