arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>GTICASR</name>
          <description>General PWM Timer Input Capture Source Select Register A</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>A,B,C,D,E,F,G,H</dimIndex>
              <name>ASELC%s</name>
              <description>ELC_GPT Event Source GTCCRA Input Capture Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the ELC_GPT input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the ELC_GPT input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASCBFAH</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value High Source GTCCRA Input Capture Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASCBFAL</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value Low Source GTCCRA Input Capture Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASCBRAH</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value High Source GTCCRA Input Capture Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASCBRAL</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value Low Source GTCCRA Input Capture Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASCAFBH</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value High Source GTCCRA Input Capture Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASCAFBL</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value Low Source GTCCRA Input Capture Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASCARBH</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value High Source GTCCRA Input Capture Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASCARBL</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value Low Source GTCCRA Input Capture Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>ASGTRG%sF</name>
              <description>GTETRG Pin Falling Input Source GTCCRA Input Capture Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the falling edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the falling edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>ASGTRG%sR</name>
              <description>GTETRG Pin Rising Input Source GTCCRA Input Capture Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRA input capture is disable at the rising edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRA input capture is enable at the rising edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTICBSR</name>
          <description>General PWM Timer Input Capture Source Select Register B</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>A,B,C,D,E,F,G,H</dimIndex>
              <name>BSELC%s</name>
              <description>ELC_GPT Event Source GTCCRB Input Capture Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the ELC_GPT input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the ELC_GPT input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSCBFAH</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value High Source GTCCRB Input Capture Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSCBFAL</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value Low Source GTCCRB Input Capture Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSCBRAH</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value High Source GTCCRB Input Capture Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSCBRAL</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value Low Source GTCCRB Input Capture Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSCAFBH</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value High Source GTCCRB Input Capture Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSCAFBL</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value Low Source GTCCRB Input Capture Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSCARBH</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value High Source GTCCRB Input Capture Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSCARBL</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value Low Source GTCCRB Input Capture Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>BSGTRG%sF</name>
              <description>GTETRG Pin Falling Input Source GTCCRB Input Capture Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the falling edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the falling edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>BSGTRG%sR</name>
              <description>GTETRG Pin Rising Input Source GTCCRB Input Capture Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>GTCCRB input capture is disable at the rising edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>GTCCRB input capture is enable at the rising edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
