arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>JCDTCD</name>
          <description>JPEG Code Data Count Lower Register</description>
          <addressOffset>0x00D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DCD</name>
              <description> Lower bytes of the counted amount of data to be compressedThe values of this register are reset before compression starts.NOTE: Read-only in Decompression.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JINTE0</name>
          <description>JPEG Interrupt Enable Register 0</description>
          <addressOffset>0x00E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>INT7</name>
              <description>This bit enables an interrupt to be generated when the number of data in the restart interval of the Huffman-coding segment is not correct in decompression.When this bit is not set to enable interrupt generation, an error code is not returned.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT6</name>
              <description>This bit enables an interrupt to be generated when the total number of data in the Huffman-coding segment is not correct in decompression. When this bit is not set to enable interrupt generation, an error code is not returned.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT5</name>
              <description>This bit enables an interrupt to be generated when the final number of MCU data in the Huffman-coding segment is not correct in decompression. When this bit is not set to enable interrupt generation, an error code is not returned.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT3</name>
              <description>This bit enables an interrupt to be generated when it has been determined that the image size and the subsampling setting of the compressed data can be read through analyzing the data. </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JINTS0</name>
          <description>JPEG Interrupt Status Register 0 </description>
          <addressOffset>0x00F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>INS6</name>
              <description>This bit is set to 1 when this module completes compression process normally.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
            </field>
            <field>
              <name>INS5</name>
              <description>This bit is set to 1 when a compressed data error occurs.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
            </field>
            <field>
              <name>INS3</name>
              <description> This bit is set to 1 when the image size and pixel format can be read. When an interrupt occurs, this module stops processing and the state is indicated by the JCRST register. To make this module resume processing, set the JPEG core process stop clear command bit (JRST) in JCCMD. </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>JCDERR</name>
          <description>JPEG Code Decode Error Register</description>
          <addressOffset>0x010</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0A</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ERR</name>
              <description>Error Code  (See tables )Identify the type of the error which has occurred in the compressed data analysis for decompression.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Normal(Decompression error codes)/Normal(Segment error codes)</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>SOI not detected(Decompression error codes)</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>SOF1 to SOFF detected(Decompression error codes)</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Unprovided pixel format detected(Decompression error codes)</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>SOF accuracy error(Decompression error codes)</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>DQT accuracy error(Decompression error codes)</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Component error 1(Decompression error codes)</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Component error 2(Decompression error codes)</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>SOF0, DQT, and DHT not detected when SOS detected(Decompression error codes)</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>SOS not detected(Decompression error codes)</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>EOI not detected (default)(Decompression error codes)</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Restart interval data number error detected(Decompression error codes)/Restart interval data number error(Segment error codes)</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Image size error detected(Decompression error codes)/Image size error(Segment error codes)</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Last MCU data number error detected(Decompression error codes)/Last MCU data number error(Segment error codes)</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Block data number error detected(Decompression error codes)/Block data number error(Segment error codes)</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JCRST</name>
          <description>JPEG Code Reset Register</description>
          <addressOffset>0x011</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RST</name>
              <description>Operating State</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>State other than below </description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Suspended state caused by interrupt sources of JINTE0 </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFECNT</name>
          <description>JPEG Interface Compression Control Register</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JOUTSWAP</name>
              <description>Byte/Halfword/Word Swap Output coded data in compression is swapped.</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>(1) (2) (3) (4) (5) (6) (7) (8) </description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>(2) (1) (4) (3) (6) (5) (8) (7) [Byte swap] </description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>(3) (4) (1) (2) (7) (8) (5) (6)  [Halfword swap] </description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>(4) (3) (2) (1) (8) (7) (6) (5) [Halfword - byte swap] </description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>(5) (6) (7) (8) (1) (2) (3) (4) [Word swap] </description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>(6) (5) (8) (7) (2) (1) (4) (3) [Word - byte swap] </description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>(7) (8) (5) (6) (3) (4) (1) (2) [Word - Halfword swap] </description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>(8) (7) (6) (5) (4) (3) (2) (1) [Word - Word - byte swap] </description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DINRINI</name>
              <description>Address Initialization when Resuming Input of Image Data Lines This bit is only valid when the count mode for stopping the input of image data lines is on. Set this bit before writing 1 to the data-line resume command bit. </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The transfer address is not initialized when the input of image data lines is restarted</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The transfer address is initialized when the input of image data lines is restarted</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DINRCMD</name>
              <description>Input Image Data Lines Resume Command This bit is valid only when the count mode for stopping the input of image data lines is on. Setting this bit to 1 resumes reading input image data. This bit is always read as 0. </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DINLC</name>
              <description> Count Mode Setting for Stopping Input Image Data Lines </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Count mode for stopping the input of image data lines is off</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Count mode for stopping the input of image data lines is on</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DINSWAP</name>
              <description> Byte/Halfword Swap </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>(1) (2) (3) (4) (5) (6) (7) (8) </description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>(2) (1) (4) (3) (6) (5) (8) (7) [Byte swap] </description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>(3) (4) (1) (2) (7) (8) (5) (6)  [Halfword swap] </description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>(4) (3) (2) (1) (8) (7) (6) (5) [Halfword - byte swap] </description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>(5) (6) (7) (8) (1) (2) (3) (4) [Word swap] </description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>(6) (5) (8) (7) (2) (1) (4) (3) [Word - byte swap] </description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>(7) (8) (5) (6) (3) (4) (1) (2) [Word - Halfword swap] </description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>(8) (7) (6) (5) (4) (3) (2) (1) [Word - Halfword - byte swap] </description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFESA</name>
          <description>JPEG Interface Compression Source Address Register</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ESA</name>
              <description> Input Image Data Source Address (in 8-byte units) The lower three bits should be set to 0.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFESOFST</name>
          <description>JPEG Interface Compression Line Offset Register</description>
          <addressOffset>0x048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ESMW</name>
              <description>Input Image Data Lines Offset(in 8-byte units)The lower three bits should be set to 0.</description>
              <lsb>0</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFEDA</name>
          <description>JPEG Interface Compression Destination Address Register</description>
          <addressOffset>0x04C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDA</name>
              <description>Input Image Data Lines Offset (in 8-byte units) The lower three bits should be set to 0.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JIFESLC</name>
          <description>JPEG Interface Compression Source Line Count Register</description>
          <addressOffset>0x050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFF8FFF8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINES</name>
              <description>Number of Input Image Data Lines to be Read (in 8-line units) The lower three bits should be set to 0. </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
