arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_PMISC</name>
      <description>I/O Ports-MISC</description>
      <baseAddress>0x40040D00</baseAddress>
      <addressBlock>
        <offset>0x00000003</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PFENET</name>
          <description>Ethernet Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 00. The write value should be 00.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYMODE1</name>
              <description>Ethernet Mode Setting ch1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>RMII mode (ETHERC channel 1)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>MII mode (ETHERC channel 1)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYMODE0</name>
              <description>Ethernet Mode Setting ch0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>RMII mode (ETHERC channel 0)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>MII mode (ETHERC channel 0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>These bits are read as 0000. The write value should be 0000.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWPR</name>
          <description>Write-Protect Register </description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PFSWE</name>
              <description>PmnPFS Register Write</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Writing to the PmnPFS register is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writing to the PmnPFS register is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B0WI</name>
              <description>PFSWE Bit Write Disable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Writing to the PFSWE bit is enabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writing to the PFSWE bit is disabled.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWPRS</name>
          <description>Write-Protect Register for Secure </description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PFSWE</name>
              <description>PmnPFS Register Write</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Writing to the PmnPFS register is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writing to the PmnPFS register is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B0WI</name>
              <description>PFSWE Bit Write Disable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Writing to the PFSWE bit is enabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writing to the PFSWE bit is disabled.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>9</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>PMSAR[%s]</name>
          <description>Port Security Attribution Register</description>
          <addressOffset>0x10</addressOffset>
          <register>
            <name>PMSAR</name>
            <description>Port Security Attribution Register</description>
            <addressOffset>0</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0xFFFF</resetValue>
            <resetMask>0xFFFF</resetMask>
          </register>
        </cluster>
