arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>SIMR3</name>
          <description>I2C Mode Register 3</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>IICSCLS</name>
              <description>SCL Output Select</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Serial clock output</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Generate a start, restart, or stop condition.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Output the low level on the SSCLn pin.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Place the SSCLn pin in the high-impedance state.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IICSDAS</name>
              <description>SDA Output Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Serial data output</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Generate a start, restart, or stop condition.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Output the low level on the SSDAn pin.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Place the SSDAn pin in the high-impedance state.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IICSTIF</name>
              <description>Issuing of Start, Restart, or Stop Condition Completed Flag(When 0 is written to IICSTIF, it is cleared to 0.)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>There are no requests for generating conditions or a condition is being generated.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A start, restart, or stop condition is completely generated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IICSTPREQ</name>
              <description>Stop Condition Generation</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A stop condition is not generated.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A stop condition is generated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IICRSTAREQ</name>
              <description>Restart Condition Generation</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A restart condition is not generated.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A restart condition is generated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IICSTAREQ</name>
              <description>Start Condition Generation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A start condition is not generated.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A start condition is generated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SISR</name>
          <description>I2C Status Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xCB</resetMask>
          <fields>
            <field>
              <name>IICACKR</name>
              <description>ACK Reception Data Flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ACK received</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>NACK received</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPMR</name>
          <description>SPI Mode Register</description>
          <addressOffset>0x0D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CKPH</name>
              <description>Clock Phase Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock is not delayed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock is delayed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKPOL</name>
              <description>Clock Polarity Select</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clock polarity is not inverted.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Clock polarity is inverted</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFF</name>
              <description>Mode Fault Flag</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No mode fault error</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Mode fault error</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSS</name>
              <description>Master Slave Select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Transmission is through the TXDn pin and reception is through the RXDn pin (master mode).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Reception is through the TXDn pin and transmission is through the RXDn pin (slave mode).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSE</name>
              <description>CTS Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>CTS function is disabled (RTS output function is enabled).</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>CTS function is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSE</name>
              <description>SSn Pin Function Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SSn pin function is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>SSn pin function is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TDRHL</name>
          <description>Transmit 9-bit Data Register</description>
          <addressOffset>0x0E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TDRHL</name>
              <description>TDRHL is a 16-bit register that stores transmit data.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FTDRHL</name>
          <description>Transmit FIFO Data Register HL</description>
          <alternateRegister>TDRHL</alternateRegister>
          <addressOffset>0x0E</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MPBT</name>
              <description>Multi-processor transfer bit flag(Valid only in asynchronous mode and SMR.MP=1 and FIFO selected)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data transmission cycles</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ID transmission cycles</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDAT</name>
              <description>Serial transmit data (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected)</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FTDRH</name>
          <description>Transmit FIFO Data Register H</description>
          <alternateRegister>TDRHL</alternateRegister>
          <addressOffset>0x0E</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>MPBT</name>
              <description>Multi-processor transfer bit flag(Valid only in asynchronous mode and SMR.MP=1 and FIFO selected)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data transmission cycles</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ID transmission cycles</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDATH</name>
              <description>Serial transmit data (b8) (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FTDRL</name>
          <description>Transmit FIFO Data Register L</description>
          <alternateRegister>TDRHL</alternateRegister>
          <addressOffset>0x0F</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TDATL</name>
              <description>Serial transmit data(b7-b0) (Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDRHL</name>
          <description>Receive 9-bit Data Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RDRHL</name>
              <description>RDRHL is an 16-bit register that stores receive data.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRDRHL</name>
          <description>Receive FIFO Data Register HL</description>
          <alternateRegister>RDRHL</alternateRegister>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RDF</name>
              <description>Receive FIFO data full flag(It is same as SSR.RDF)</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The quantity of receive data written in FRDRH and FRDRL falls below the specified receive triggering number.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The quantity of receive data written in FRDRH and FRDRL is equal to or greater than the specified receive triggering number.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ORER</name>
              <description>Overrun error flag(It is same as SSR.ORER)</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No overrun error occurred.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An overrun error has occurred.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FER</name>
              <description>Framing error flag</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No framing error occurred at the first data of FRDRH and FRDRL.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A framing error has occurred at the first data of FRDRH and FRDRL.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>Parity error flag</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No parity error occurred at the first data of FRDRH and FRDRL.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A parity error has occurred at the first data of FRDRH and FRDRL.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DR</name>
              <description>Receive data ready flag(It is same as SSR.DR)</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Receiving is in progress, or no received data has remained in FRDRH and FRDRL after normally completed receiving.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Next receive data has not been received for a period after normal completed receiving. </description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPB</name>
              <description>Multi-processor bit flag(Valid only in asynchronous mode with SMR.MP=1 and FIFO selected) It can read multi-processor bit corresponded to serial receive data(RDATA[8:0])</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data transmission cycles</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ID transmission cycles</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDAT</name>
              <description>Serial receive data(Valid only in asynchronous mode(including multi-processor) or clock synchronous mode, and FIFO selected)</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
