arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <dim>5</dim>
          <dimIncrement>4</dimIncrement>
          <name>PGAC[%s]</name>
          <description>Input Multiplexer %s Setting Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PGAASN</name>
              <description>Selection of the mode for specifying the number of A/D conversions in ADSCAN</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Specify 1 to 8,032 times by using the value set in the PGACTN[2:0] and PGACTM[4:0] bits</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Specify 1 to 255 times linearly by using the value set in the PGACTN[2:0] and PGACTM[4:0] bits</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGACVE</name>
              <description>Calibration enable</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Do not calculate the calibration correction factor</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Calculate the calibration correction factor</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAREV</name>
              <description>Single-End Input A/D Converted Data Inversion Select</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Do not invert the conversion result data</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Invert the conversion result data</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAAVE</name>
              <description>Selection of averaging processing</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Do not average the A/D conversion results</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Do not average the A/D conversion results</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Average the A/D conversion results and generates SDADC_ADI each time an A/D conversion occurs</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Perform averaging, and generate SDADC_ADI at each time of average value output (A/D conversion is performed N times).</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAAVN</name>
              <description>Selection of the number of data to be averaged</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>8</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>16</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>32</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>64</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGACTN</name>
              <description>Coefficient (n) selection of the A/D conversion count (N) in AUTOSCAN</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>0</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>1</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>2</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>3</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>4</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>5</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>6</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>7</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGACTM</name>
              <description>Coefficient (m) selection of the A/D conversion count (N) in AUTOSCAN</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PGASEL</name>
              <description>Analog Channel Input Mode Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Differential input mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Single-end input mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAPOL</name>
              <description>Polarity select</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Positive-side single-end input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Negative-side single-end input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAOFS</name>
              <description>Offset voltage select</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PGAOSR</name>
              <description>Oversampling ratio select</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>64</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>128</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>256</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>512</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>1024</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>2048</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Settings are prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAGC</name>
              <description>Gain selection of a programmable gain instrumentation amplifier ( Gset1, Gset2, Gtotal )</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00000</name>
                  <description>(1, 1, 1)</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00100</name>
                  <description>(2, 1, 2)</description>
                  <value>#00100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01000</name>
                  <description>(3, 1, 3)</description>
                  <value>#01000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01100</name>
                  <description>(4, 1, 4)</description>
                  <value>#01100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10000</name>
                  <description>(8, 1, 8)</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00001</name>
                  <description>(1, 2, 2)</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00101</name>
                  <description>(2, 2, 4)</description>
                  <value>#00101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01001</name>
                  <description>(3, 2, 6)</description>
                  <value>#01001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01101</name>
                  <description>(4, 2, 8)</description>
                  <value>#01101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10001</name>
                  <description>(8, 2, 16)</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00010</name>
                  <description>(1, 4, 4)</description>
                  <value>#00010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00110</name>
                  <description>(2, 4, 8)</description>
                  <value>#00110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01010</name>
                  <description>(3, 4, 12)</description>
                  <value>#01010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01110</name>
                  <description>(4, 4, 16)</description>
                  <value>#01110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10010</name>
                  <description>(8, 4, 32)</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00011</name>
                  <description>(1, 8, 8)</description>
                  <value>#00011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00111</name>
                  <description>(2, 8, 16)</description>
                  <value>#00111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01011</name>
                  <description>(3, 8, 24)</description>
                  <value>#01011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01111</name>
                  <description>(4, 8, 32).</description>
                  <value>#01111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Settings are prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1</name>
          <description>Sigma-Delta A/D Converter Control Register 1</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PGASLFT</name>
              <description>PGA offset self-diagnosis enable</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable PGA offset self-diagnosis</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable PGA offset self-diagnosis</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGADISC</name>
              <description>Disconnection Detection Assist Setting</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Discharge</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Pre-charge</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGADISA</name>
              <description>Control of disconnection detection</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>State of disconnection detection</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDADBMP</name>
              <description>A/D conversion control of the signal from input multiplexer</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SDADTMD</name>
              <description>Selection of A/D conversion trigger signal</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Software trigger (conversion is started by a write to SFR)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Hardware trigger (conversion is started in synchronization with the event signal selected by ELC_SDADC24).</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDADSCM</name>
              <description>Selection of autoscan mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Continuous scan mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Single scan mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2</name>
          <description>Sigma-Delta A/D Converter Control Register 2</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SDADST</name>
              <description>Control of A/D conversion</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stop A/D conversion</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Start A/D conversion</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCR</name>
          <description>Sigma-delta A/D Converter Conversion Result Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDADCRC</name>
              <description>Channel number for an A/D conversion result</description>
              <lsb>25</lsb>
              <msb>27</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Reset value (Conversion result is invalid)</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Input multiplexer 0 (ANSD0P / ANSD0N)</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Input multiplexer 1 (ANSD1P / ANSD1N)</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Input multiplexer 2 (ANSD2P / ANSD2N)</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Input multiplexer 3 (ANSD3P / ANSD3N)</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Input multiplexer 4 (AMP0O / AMP1O)</description>
                  <value>#101</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDADCRS</name>
              <description>Status of an A/D conversion result</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal status (within the range)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Overflow occurred</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDADCRD</name>
              <description>The 24-bit A/D conversion result</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
