arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>SSIOFR</name>
          <description>Audio Format Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BCKASTP</name>
              <description>Whether to Enable Stopping BCK Output When SSIE is in Idle Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Always outputs BCK to the SSIBCK pin.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Automatically controls output of BCK to the SSIBCK pin.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LRCONT</name>
              <description>Whether to Enable LRCK/FS Continuation</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables LRCK/FS continuation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables LRCK/FS continuation.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OMOD</name>
              <description>Audio Format Select</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>I2S format</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>TDM format</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Monaural format</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSISCR</name>
          <description>Status Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDES</name>
              <description>TDE Setting Condition Select</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00000</name>
                  <description>SSIFTDR has one stage or more free space</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00001</name>
                  <description>SSIFTDR has two stages or more free space (snip)</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11110</name>
                  <description>SSIFTDR has thirty-one stages or more free space</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11111</name>
                  <description>SSIFTDR has thirty-two stages or more free space.</description>
                  <value>#11111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDFS</name>
              <description>RDF Setting Condition Select</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00000</name>
                  <description>SSIFRDR has one stage or more data size</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00001</name>
                  <description>SSIFRDR has two stages or more data size (snip)</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11110</name>
                  <description>SSIFRDR has thirty-one stages or more data size</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11111</name>
                  <description>SSIFRDR has thirty-two stages or more data size.</description>
                  <value>#11111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="R_SSI0">
      <name>R_SSI1</name>
      <description>Serial Sound Interface Enhanced (SSIE)</description>
      <baseAddress>0x4004E100</baseAddress>
    </peripheral>
    <peripheral>
      <name>R_SYSTEM</name>
      <description>System Pins</description>
      <baseAddress>0x4001E000</baseAddress>
      <addressBlock>
        <offset>0x0000000C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000001C</offset>
        <size>0x009</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000026</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000028</offset>
        <size>0x004</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000030</offset>
        <size>0x003</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000036</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000038</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000003E</offset>
        <size>0x004</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000050</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000052</offset>
        <size>0x002</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000061</offset>
        <size>0x002</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000092</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000094</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000098</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000009E</offset>
        <size>0x003</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000A2</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000A5</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000AA</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000C0</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000D1</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000E0</offset>
        <size>0x004</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000003FE</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000402</offset>
        <size>0x00B</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000040E</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000410</offset>
        <size>0x002</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000413</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000417</offset>
        <size>0x002</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000041A</offset>
        <size>0x002</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000041F</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000480</offset>
        <size>0x002</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000490</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000492</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000004B0</offset>
        <size>0x003</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000004B4</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000004B6</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000004B8</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000500</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SBYCR</name>
          <description>Standby Control Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SSBY</name>
              <description>Software Standby</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Sleep mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Software Standby mode (DPSBYCR.DPSBY=0) / Deep Software Standby mode (DPSBYCR.DPSBY=1)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPE</name>
              <description>Output Port Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>In software standby mode or deep software standby mode, the address bus and bus control signals are set to the high-impedance state.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>In software standby mode or deep software standby mode, the address bus and bus control signals retain the output state..</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MSTPCRA</name>
          <description>Module Stop Control Register A</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFBFFF1C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSTPA22</name>
              <description>DMA Controller/Data Transfer Controller Module Stop</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Cancel the module-stop state</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enter the module-stop state</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTPA7</name>
              <description>Standby RAM Module Stop</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Cancel the module-stop state</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enter the module-stop state</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTPA6</name>
              <description>ECCRAM Module Stop</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Cancel the module-stop state</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enter the module-stop state</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTPA5</name>
              <description>High-Speed RAM Module Stop</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Cancel the module-stop state</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enter the module-stop state</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTPA1</name>
              <description>RAM1 Module Stop</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Cancel the module-stop state</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enter the module-stop state</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTPA0</name>
              <description>RAM0 Module Stop</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Cancel the module-stop state</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enter the module-stop state</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
