arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>D1FIFOSEL</name>
          <description>D1FIFO Port Select Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RCNT</name>
              <description>Read Count Mode</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The DTLN[8:0] bits (CFIFOCRT.DTLN[8:0], D0FIFOCRT.DTLN[8:0], D1FIFOCRT.DTLN[8:0]) are cleared when all of the receive data has been read from the DnFIFO.(In double buffer mode, the DTLN bit Value is cleared when all the data has been read from only a single plane.)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The DTLN[8:0] bits are decremented each time the receive data is read from the DnFIFO. (n = 0, 1)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REW</name>
              <description>Buffer Pointer Rewind</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The buffer pointer is not rewound.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The buffer pointer is rewound.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCLRM</name>
              <description>Auto Buffer Memory Clear Mode Accessed after Specified Pipe Data is Read</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Auto buffer clear mode is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Auto buffer clear mode is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DREQE</name>
              <description>DMA/DTC Transfer Request Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DMA/DTC transfer request is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DMA/DTC transfer request is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBW</name>
              <description>FIFO Port Access Bit Width</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>8-bit width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>16-bit width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>32-bit width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIGEND</name>
              <description>FIFO Port Endian Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Little endian</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Big endian</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURPIPE</name>
              <description>FIFO Port Access Pipe Specification</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>DCP (Default control pipe)</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Pipe 1</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Pipe 2</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Pipe 3</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Pipe 4</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Pipe 5</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Pipe 6</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Pipe 7</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Pipe 8</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Pipe 9</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D1FIFOCTR</name>
          <description>D1FIFO Port Control Register</description>
          <addressOffset>0x02E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BVAL</name>
              <description>Buffer Memory Valid Flag</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Invalid</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writing ended</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCLR</name>
              <description>CPU Buffer ClearNote: Only 0 can be read.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Does not operate</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>FIFO buffer cleared on the CPU side.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRDY</name>
              <description>FIFO Port Ready</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FIFO port access is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>FIFO port access is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTLN</name>
              <description>Receive Data LengthIndicates the length of the receive data.</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENB0</name>
          <description>Interrupt Enable Register 0</description>
          <addressOffset>0x030</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VBSE</name>
              <description>VBUS Interrupt Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSME</name>
              <description>Resume Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFE</name>
              <description>Frame Number Update Interrupt Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DVSE</name>
              <description>Device State Transition Interrupt Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRE</name>
              <description>Control Transfer Stage Transition Interrupt Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEMPE</name>
              <description>Buffer Empty Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NRDYE</name>
              <description>Buffer Not Ready Response Interrupt Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRDYE</name>
              <description>Buffer Ready Interrupt Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENB1</name>
          <description>Interrupt Enable Register 1 </description>
          <addressOffset>0x032</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OVRCRE</name>
              <description>Overcurrent Input Change Interrupt Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCHGE</name>
              <description>USB Bus Change Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCHE</name>
              <description>Disconnection Detection Interrupt Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATTCHE</name>
              <description>Connection Detection Interrupt Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOFERRE</name>
              <description>EOF Error Detection Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIGNE</name>
              <description>Setup Transaction Error Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SACKE</name>
              <description>Setup Transaction Normal Response Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDDETINTE0</name>
              <description>PDDETINT0 Detection Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt output disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt output enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
