arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>BEMPSTS</name>
          <description>BEMP Interrupt Status Register</description>
          <addressOffset>0x04A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <dim>10</dim>
              <dimIncrement>1</dimIncrement>
              <name>PIPE%sBEMP</name>
              <description>BEMP Interrupt Status for PIPE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupts are not generated.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupts are generated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRMNUM</name>
          <description>Frame Number Register</description>
          <addressOffset>0x04C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OVRN</name>
              <description>Overrun/Underrun Detection Status</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No error</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An error occurred</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCE</name>
              <description>Receive Data Error</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No error</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An error occurred</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRNM</name>
              <description>Frame NumberLatest frame number</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UFRMNUM</name>
          <description>uFrame Number Register </description>
          <addressOffset>0x04E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x8007</resetMask>
          <fields>
            <field>
              <name>DVCHG</name>
              <description>Device State Change</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables the writing to the USBADDR.STSRECOV0[2:0] bits and USBADDR.USBADDR[6:0].</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables the writing to the USBADDR.STSRECOV0[2:0] bits and USBADDR.USBADDR[6:0].</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UFRNM</name>
              <description>MicroframeIndicate the microframe number.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBADDR</name>
          <description>USB Address Register</description>
          <addressOffset>0x050</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x077F</resetMask>
          <fields>
            <field>
              <name>STSRECOV0</name>
              <description>Status Recovery</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>001</name>
                  <description>Return to the full-speed state(bits DVSTCTR0.RHST[2:0] = 010b), bits INTSTS0.DVSQ[2:0] = 001b (Default state)(function controller selected)</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Return to the full-speed state (bits DVSTCTR0.RHST[2:0] = 010b), bits INTSTS0.DVSQ[2:0] = 010b (Address state)(function controller selected)/ Return to the low-speed state (bitsDVSTCTR0.RHST[2:0] = 001b)(host controller is selected)</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Return to the full-speed state (bits DVSTCTR0.RHST[2:0] = 010b), bits INTSTS0.DVSQ[2:0] = 011b (Configured state)(function controller selected)</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Return to the full-speed state (bits DVSTCTR0.RHST[2:0] = 010b)(host controller selected)</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Return to the high-speed state (bits DVSTCTR0.RHST[2:0] = 011b), bits INTSTS0.DVSQ[2:0] = 001b (Default state)(function controller selected)</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>Return to the high-speed state (bits DVSTCTR0.RHST[2:0] = 011b), bits INTSTS0.DVSQ[2:0] = 010b (Address state)(function controller selected)/ Return to the high-speed state (bits DVSTCTR0.RHST[2:0] = 011b)(host controller selected)</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>Return to the high-speed state (bits DVSTCTR0.RHST[2:0] = 011b), bits INTSTS0.DVSQ[2:0] = 011b (Configured state)(function controller selected)</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBADDR</name>
              <description>USB Address In device controller mode, these flags indicate the USB address assigned by the host when the USBHS processed the SET_ADDRESS request successfully.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBREQ</name>
          <description>USB Request Type Register</description>
          <addressOffset>0x054</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BREQUEST</name>
              <description>RequestThese bits store the USB request bRequest value.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BMREQUESTTYPE</name>
              <description>Request TypeThese bits store the USB request bmRequestType value.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBVAL</name>
          <description>USB Request Value Register</description>
          <addressOffset>0x056</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WVALUE</name>
              <description>ValueThese bits store the USB request Value value.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBINDX</name>
          <description>USB Request Index Register</description>
          <addressOffset>0x058</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WINDEX</name>
              <description>IndexThese bits store the USB request wIndex value.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBLENG</name>
          <description>USB Request Length Register</description>
          <addressOffset>0x05A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WLENGTH</name>
              <description>LengthThese bits store the USB request wLength value.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCPCFG</name>
          <description>DCP Configuration Register</description>
          <addressOffset>0x05C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CNTMD</name>
              <description>Continuous Transfer Mode</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Non-continuous transfer mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Continuous transfer mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHTNAK</name>
              <description>Pipe Disabled at End of Transfer</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Pipe continued at the end of transfer</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Pipe disabled at the end of transfer</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Transfer Direction</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data receiving direction</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Data transmitting direction</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCPMAXP</name>
          <description>DCP Maximum Packet Size Register</description>
          <addressOffset>0x05E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0040</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DEVSEL</name>
              <description>Device Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Address 0000</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Address 0001</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Address 0010</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Address 0011</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Address 0100</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Address 0101</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Settings prohibited.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MXPS</name>
              <description>Maximum Packet SizeThese bits set the maximum amount of data (maximum packet size) in payloads for the DCP.</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>8 bytes</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>16 bytes</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x18</name>
                  <description>24 bytes</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x20</name>
                  <description>32 bytes</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x28</name>
                  <description>40 bytes</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x30</name>
                  <description>48 bytes</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x38</name>
                  <description>56 bytes</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x40</name>
                  <description>64 bytes</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x48</name>
                  <description>72 bytes</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x50</name>
                  <description>80 bytes</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x58</name>
                  <description>88 bytes</description>
                  <value>0x58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x60</name>
                  <description>96 bytes</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x68</name>
                  <description>104 bytes</description>
                  <value>0x68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x70</name>
                  <description>112 bytes</description>
                  <value>0x70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x78</name>
                  <description>120 bytes</description>
                  <value>0x78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
