arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>CDSR</name>
          <description>Controller and Device Setting Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>DV0TTYP</name>
              <description>Device0_transfer_type setting</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>SPI mode</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>SOPI mode</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>DOPI mode</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DV1TTYP</name>
              <description>Device1_transfer_type setting</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>SPI mode</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>SOPI mode</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>DOPI mode</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DV0PC</name>
              <description>Device0_memory precycle setting</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DV1PC</name>
              <description>Device1_memory precycle setting</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMEME0</name>
              <description>Automatic calibration memory enable setting for device 0</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMEME1</name>
              <description>Automatic calibration memory enable setting for device 1</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMODE</name>
              <description>Automatic calibration mode</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Automatic calibration is disabled</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Automatic calibration is enabled and modify MDTR</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Automatic calibration immediately is executed for all trim code, but
 it will not modify MDTR</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLFT</name>
              <description>Deadlock Free Timer Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Enable timer</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Disable timer</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDLR</name>
          <description>Memory Map Dummy Length Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>DV0RDL</name>
              <description>Device 0 Read dummy length setting</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DV0WDL</name>
              <description>Device 0 Write dummy length setting</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DV1RDL</name>
              <description>Device 1 Read dummy length setting</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DV1WDL</name>
              <description>Device 1 Write dummy length setting</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>MRWCR[%s]</name>
          <description>Memory Map Read/Write Command Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>DMRCMD0</name>
              <description>Memory map read command 0 setting</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMRCMD1</name>
              <description>Memory map read command 1 setting</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMWCMD0</name>
              <description>Memory map write command 0 setting</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMWCMD1</name>
              <description>Memory map write command 1 setting</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MRWCSR</name>
          <description>Memory Map Read/Write Setting Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>MRAL0</name>
              <description>Device 0 read address length setting</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MRCL0</name>
              <description>Device 0 read command length setting</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MRO0</name>
              <description>Device 0 read order setting</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Read order is byte0, byte1, byte2, byte3.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Read order is byte1, byte0, byte3, byte2.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREN0</name>
              <description>Preamble bit enable for mem0 memory-map read</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No check preamble bit</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Check preamble bit from OctaFlash (if OctaFlash is connected to device 0)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MWAL0</name>
              <description>Device 0 write address length setting</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MWCL0</name>
              <description>Device 0 write command length setting</description>
              <lsb>11</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MWO0</name>
              <description>Device 0 write order setting</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Write order is byte0, byte1, byte2, byte3.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Write order is byte1, byte0, byte3, byte2.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRAL1</name>
              <description>Device 1 read address length setting</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MRCL1</name>
              <description>Device 1 read command length setting</description>
              <lsb>19</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MRO1</name>
              <description>Device 1 read order setting</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Read order is byte0, byte1, byte2, byte3.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Read order is byte1, byte0, byte3, byte2.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREN1</name>
              <description>Preamble bit enable for mem1 memory-map read</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No check preamble bit</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Check preamble bit from OctaFlash (if OctaFlash is connected to device 1)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MWAL1</name>
              <description>Device 1 write address length setting</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MWCL1</name>
              <description>Device 1 write command length setting</description>
              <lsb>27</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MWO1</name>
              <description>Device 1 write order setting</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Write order is byte0, byte1, byte2, byte3.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Write order is byte1, byte0, byte3, byte2.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ESR</name>
          <description>Error Status Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>MRESR</name>
              <description>Memory map read error status</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x01</name>
                  <description>ECC error</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>Preamble error</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x03</name>
                  <description>Wait OM_DQS timeout</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x80</name>
                  <description>Invalid command</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Others</name>
                  <description>Reserved</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MWESR</name>
              <description>Memory map write error status</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x80</name>
                  <description>Invalid command</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Others</name>
                  <description>Reserved </description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CWNDR</name>
          <description>Configure Write without Data Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>WND</name>
              <description>The write value should be 0.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CWDR</name>
          <description>Configure Write Data Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>WD0</name>
              <description>Write data 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>WD1</name>
              <description>Write data 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>WD2</name>
              <description>Write data 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>WD3</name>
              <description>Write data 3</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRR</name>
          <description>Configure Read Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>RD0</name>
              <description>Read data 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RD1</name>
              <description>Read data 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RD2</name>
              <description>Read data 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RD3</name>
              <description>Read data 3</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
