arcrin/clc_test_firmware/firmwareutil/hal/svd/RA6M4.svd
        <register>
          <name>ACSR</name>
          <description>Auto-Calibration Status Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>ACSR0</name>
              <description>Auto-calibration status of device 0</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Initial state </description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Reserved </description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Reserved </description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Normal end </description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Error end</description>
                  <value>#100</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACSR1</name>
              <description>Auto-calibration status of device 1</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Initial state </description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Reserved </description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Reserved </description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Normal end </description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Error end</description>
                  <value>#100</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCSMXR</name>
          <description>Device Chip Select Maximum Period Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>CTWMX0</name>
              <description>Indicates the maximum period that OM_CS0 and OM_CS1 are Low
 in single continuous write of OctaRAM.</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTWMX1</name>
              <description>Indicates the maximum period that OM_CS0 and OM_CS1 are Low
 in single continuous read of OctaRAM.</description>
              <lsb>16</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWSCTSR</name>
          <description>Device Memory Map Write single continuous translating size Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>CTSN0</name>
              <description>Indicates the number of bytes to translate in single continuous write of device 0.</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSN1</name>
              <description>Indicates the number of bytes to translate in single continuous write of device 1.</description>
              <lsb>16</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
